tap "homebrew/bundle"
brew "python@3.12"
brew "aarch64-elf-gdb"
brew "cmake"
brew "fd"
brew "fzf"
brew "libtensorflow"
brew "neovim"
brew "node"
brew "numpy"
brew "pipx"
brew "pkg-config"
brew "python-matplotlib"
brew "raylib"
brew "scipy"
brew "sfml"
brew "speedtest-cli"
brew "tmux"
brew "vcpkg"
cask "google-chrome"
cask "hiddenbar"
cask "iterm2"
cask "obsidian"
cask "raycast"
cask "stats"
cask "utm"
cask "visual-studio-code"
vscode "andenetalexander.vim-cheatsheet"
vscode "codeium.codeium"
vscode "codestackr.codestackr-theme"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "nextbook.file-and-folder-icons"
vscode "platformio.platformio-ide"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "staticvoid.thm"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
vscode "xaver.clang-format"
